sdaiRemoveModel(Sdai_instS*,Sdai_instS*)
\details
Removes a specified model from a schema instance.
\param schemaInstance [in] A schema instance.
\param model          [in] A model to be removed.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiSI_NEXS - Schema instance does not exist.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMO_NVLD - SDAI-model invalid.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiSY_ERR - Underlying system error.